export const UNIVERSITIES_LIST = [
  // Россия - Москва
  "МГУ имени М.В. Ломоносова", "МФТИ (Физтех)", "НИУ ВШЭ (Высшая школа экономики)",
  "МГТУ им. Н.Э. Баумана", "НИЯУ МИФИ", "МГИМО", "МЭИ", "РАНХиГС", "РУДН",
  "РГУ нефти и газа им. И.М. Губкина", "РЭУ им. Г.В. Плеханова", "Финашка (Финансовый университет)",
  "МАИ", "МИСИС", "РТУ МИРЭА", "РГГУ", "РНИМУ им. Н.И. Пирогова", "Первый МГМУ им. И.М. Сеченова",
  "МГЛУ (Иняз Мориса Тореза)", "ВГИК", "ГИТИС", "МГЮА им. Кутафина",
  
  // Россия - Санкт-Петербург
  "СПбГУ", "ИТМО", "СПбПУ Петра Великого", "СПбГЭТУ ЛЭТИ", "Горный университет",
  "СПбГЭУ", "СЗИУ РАНХиГС", "Первый СПбГМУ им. Павлова", "СЗГМУ им. Мечникова",
  "СПбГУАП", "СПбГУТ им. Бонч-Бруевича", "Балтийский государственный технический университет (Военмех)",

  // Регионы России
  "НГУ (Новосибирск)", "НГТУ (Новосибирск)", "ТГУ (Томск)", "ТПУ (Томск)",
  "УрФУ имени Б.Н. Ельцина", "КФУ (Казань)", "КНИТУ-КАИ", "СГАУ (Самара)",
  "ЮФУ (Ростов-на-Дону)", "ДВФУ (Владивосток)", "СВФУ (Якутск)", "БФУ им. Канта (Калининград)",
  "УГНТУ (Уфа)", "УУНиТ (Уфа)", "Нижегородский государственный университет им. Н.И. Лобачевского",
  "Пермский государственный национальный исследовательский университет", "СГУ им. Чернышевского (Саратов)",

  // Беларусь
  "БГУ (Минск)", "БНТУ (Минск)", "БГУИР (Минск)", "БГМУ", "МГЛУ (Минск)",

  // Казахстан
  "НУ (Назарбаев Университет)", "КазНУ им. аль-Фараби", "ЕНУ им. Гумилева",
  "КБТУ (Казахстанско-Британский технический университет)",
  "МУИТ (Международный университет информационных технологий)",
  "SDU (Университет имени Сулеймана Демиреля)", "Narxoz (Нархоз)", "KIMEP", "AITU",

  // Узбекистан
  "НУУз (Национальный университет Узбекистана)", "ТГТУ (Ташкент)", "ТУИТ (Ташкент)",
  "Инха в Ташкенте (IUT)", "УМЭД", "ТМА (Медицинская академия)",

  // Украина
  "КНУ им. Тараса Шевченко", "КПИ им. Игоря Сикорского", "ХНУ им. В.Н. Каразина",
  "ЛНУ им. Ивана Франко", "НаУКМА (Киево-Могилянская академия)", "ХПИ (Харьков)", "НУ ЛП (Львовская политехника)"
].sort(); // Sorting array alphabetically

export const DORMITORIES_LIST = [
  // Знаменитые
  "ДСЛ МГУ", "ДСВ МГУ", "ДАС МГУ", "ФДС МГУ", "ДСК МГУ",
  "ПУНК СПбГУ", "ВУНК СПбГУ",
  "Деревня Универсиады (Казань)",
  "Студгородок НГУ", "М-Общежитие НГУ", "Общежитие №1-Б НГУ",
  "Студгородок МГТУ", "Общежитие МИФИ", "Дубки (ВШЭ)", "Одинцово (ВШЭ)",
  
  // Стандартные (цифры)
  "Общежитие №1", "Общежитие №2", "Общежитие №3", "Общежитие №4", 
  "Общежитие №5", "Общежитие №6", "Общежитие №7", "Общежитие №8",
  "Общежитие №9", "Общежитие №10", "Общежитие №11", "Общежитие №12",
  "Общежитие №13", "Общежитие №14",

  // Абстрактные
  "Главный корпус (общежитие)", "Студенческий городок", "Кампус A", "Кампус B", "Кампус C", "Левое крыло", "Правое крыло"
].sort();
